-- -------------------------------------------------- --
-- Данные для тестирования API управления картотеками --
-- -------------------------------------------------- --
INSERT INTO "catalogs" ("id", "name", "description") OVERRIDING SYSTEM VALUE
VALUES
(01, 'Каталог 01', 'Описание каталога 01'),
(02, 'Каталог 02', 'Описание каталога 02'),
(03, 'Каталог 03', 'Описание каталога 03'),
(04, 'Каталог 04', 'Описание каталога 04'),
(05, 'Каталог 05', 'Описание каталога 05'),
(06, 'Каталог 06', 'Описание каталога 06'),
(07, 'Каталог 07', 'Описание каталога 07'),
(08, 'Каталог 08', 'Описание каталога 08'),
(09, 'Каталог 09', 'Описание каталога 09'),
(10, 'Каталог 10', 'Описание каталога 10'),
(11, 'Каталог 11', 'Описание каталога 11'),
(12, 'Каталог 12', 'Описание каталога 12'),
(13, 'Каталог 13', 'Описание каталога 13'),
(14, 'Каталог 14', 'Описание каталога 14'),
(15, 'Каталог 15', 'Описание каталога 15'),
(16, 'Каталог 16', 'Описание каталога 16'),
(17, 'Каталог 17', 'Описание каталога 17'),
(18, 'Каталог 18', 'Описание каталога 18'),
(19, 'Каталог 19', 'Описание каталога 19'),
(20, 'Каталог 20', 'Описание каталога 20'),
(21, 'Каталог 21', 'Описание каталога 21'),
(22, 'Каталог 22', 'Описание каталога 22'),
(23, 'Каталог 23', 'Описание каталога 23'),
(24, 'Каталог 24', 'Описание каталога 24'),
(25, 'Каталог 25', 'Описание каталога 25'),
(26, 'Каталог 26', 'Описание каталога 26'),
(27, 'Каталог 27', 'Описание каталога 27'),
(28, 'Каталог 28', 'Описание каталога 28');

INSERT INTO "user_authorities" ("catalog_id", "user_uuid", "authority")
VALUES
(01, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'MASTER'),
(02, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'GRANT_AUTHORITY'),
(03, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'READING'),
(04, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'WRITING'),
(05, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'DELETING'),
(06, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'FIELD_TEMPLATE_WRITING'),
(07, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'FIELD_TEMPLATE_DELETING'),
(08, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'FILE_UPLOAD'),
(09, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'FILE_DOWNLOAD'),
(10, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'FILE_SYSTEM_READ'),
(11, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'FILE_SYSTEM_WRITE'),
(12, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'FILE_SYSTEM_DELETE'),
(13, 'bfe5e92a-ba1f-4412-a5e9-2aba1fc41272', 'MASTER'),
(14, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(15, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(16, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(17, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(18, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(19, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(20, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(21, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(22, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(23, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(24, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(25, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(26, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(27, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER'),
(28, '90832d42-c151-4da1-832d-42c151ada1f8', 'MASTER');



ALTER SEQUENCE "catalogs_id_seq" RESTART WITH 57;
